       /* ────────────────────────────────────────────────────────── *
        │                                                            │
        │   Серия тестов PC Tech Journal                             │
        │   Тест оптимизации кода Си                                 │
        │                                                            │
        │   Copyright (c) 1988 Ziff-Devis Publishing Company         │
        │                                                            │
        │   Эта  программа-тест  была  разработана  для  проверки    │
        │   методов оптимизации  кода,  применяемых  компилятором    │
        │   Си. Она  не  вырабатывает  разумные  результаты  и  не   │
        │   представляет хороший стиль программирования.             │
        │                                                            │
        * ────────────────────────────────────────────────────────── */


       #include <stdio.h>
       #include <string.h>

       int    i, j, k, l, m;
       int    i2, j2, k2;
       int    g3, h3, i3, k3, m3;
       int    i4, j4;
       int    i5, j5, k5;


       int /* cdecl */  main( argc, argv )           /* optbench */
            int argc;
            char **argv;
         {
	   /* ──────────────────────────── *
            │ Размножение констант и копий │
            *──────────────────────────────*/

j4 = 2;
if( i2 < j4 && i4 < j4 )
    i2 = 2;

j4 = k5;
if( i2 < j4 && i4 < j4 )
    i5 = 3;

         }