       /* ────────────────────────────────────────────────────────── *
        │                                                            │
        │   Серия тестов PC Tech Journal                             │
        │   Тест оптимизации кода Си                                 │
        │                                                            │
        │   Copyright (c) 1988 Ziff-Devis Publishing Company         │
        │                                                            │
        │   Эта  программа-тест  была  разработана  для  проверки    │
        │   методов оптимизации  кода,  применяемых  компилятором    │
        │   Си. Она  не  вырабатывает  разумные  результаты  и  не   │
        │   представляет хороший стиль программирования.             │
        │                                                            │
        * ────────────────────────────────────────────────────────── */


       #include <stdio.h>
       #include <string.h>

       int    i, j, k, l, m;
       int    i2, j2, k2;
       int    g3, h3, i3, k3, m3;
       int    i4, j4;
       int    i5, j5, k5;

       double flt_1, flt_2, flt_3, flt_4, flt_5, flt_6;


       int /* cdecl */  main( argc, argv )           /* optbench */
            int argc;
            char **argv;
         {
           /* ────────────────────────────────────────── *
	    │ Свертка констант, арифметические тождества │
            │ и излишние операции загрузки/сохранения    │
            * ────────────────────────────────────────── */

            i3 = 1 + 2;
            flt_1 = 2.4 + 6.3;
            i2 = 5;
            j2 = i + 0;
            k2 = i / 1;
            i4 = i * 1;
            i5 = i * 0;

         }